rapport/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-03 Wed 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rapport de stage</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lilian Derain" />
</head>
<body>
<div id="content">
<h1 class="title">Rapport de stage</h1>

<div id="outline-container-orgcb91b2d" class="outline-2">
<h2 id="orgcb91b2d"><span class="section-number-2">1</span> Remerciement</h2>
</div>
<div id="outline-container-orgdd01d50" class="outline-2">
<h2 id="orgdd01d50"><span class="section-number-2">2</span> Résumé/Abstract</h2>
<div class="outline-text-2" id="text-2">
<p>
Stage de 3 mois au labo Verimag.
L'objectif de ce stage est d'utiliser des méthodes formelles pour prouver de façon la plus automatisée possible la correction d'algorithmes distribués auto-stabilisants.
L'idée de ce stage est d'explorer d'autres techniques de preuves, basées sur la logique de séparation et  des solveurs SMT. 
En particulier l'article why3-do se présentant comme un modèle pour la preuve d'algorithmes distribués auto-stabilisants basé sur l'outil Why3  
L'objectif de ce stage  est d'évaluer ce qu'il est possible et impossible  de faire  avec ces  outils compte  tenu de  leur maturité actuelle.
</p>
</div>
</div>

<div id="outline-container-orgf647d42" class="outline-2">
<h2 id="orgf647d42"><span class="section-number-2">3</span> Contexte</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org058b948" class="outline-3">
<h3 id="org058b948"><span class="section-number-3">3.1</span> Verimag</h3>
<div class="outline-text-3" id="text-3-1">
<p>
   Le laboratoire VERIMAG est un centre de recherche en informatique situé à Grenoble. Fondé
en 1991, le laboratoire est affilié à l’UGA. Le laboratoire vise à produire des outils théoriques
et techniques sur les systèmes informatisés en mettant en place une rigueur mathématiques.
Le laboratoire agit sur de nombreux problèmes tels que les circuits, les processeurs, des al-
gorithmes distribués et des systèmes intégrants de l’IA.
L’une des spécialités du laboratoire est la vérifcation formelle. Il s’agit d’une approche
mathématique permettant de garantir que des systèmes répondent bien aux spécifications
et propriétés. Erwan Jahier et Karine Altisen utilise font de la vérification formelle dans le 
cadre des algorithmes distribués auto-stabilisants. Ce sont des algorithmes qui peuvent 
atteindre un état correct depuis n'importe quel état sans intervention externe.
</p>
</div>
</div>


<div id="outline-container-org5e3ff1e" class="outline-3">
<h3 id="org5e3ff1e"><span class="section-number-3">3.2</span> Organisation de travail</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Au début -&gt; installations des outils (why3 et why3-do ) et apprentissage des connaissances de bases (logique de hoare, smt solver, algo distribué auto-stabilisant)
</p>

<p>
Echanges fréquents avec Erwan sur les questions/problèmes rencontrés
</p>

<p>
Et réunion toutes les une semaine ou deux aver Erwan et Karine pour mettre au point les avancements depuis la dernière réunion : 
</p>
<ol class="org-ol">
<li>Expliquer ce que j'ai compris -&gt; le fonctionnement et les limitations de ce sur quoi je travaille</li>
<li>Présenter mon avancement actuel : ce que j'ai réussi, ce qui marche (pas), là où je suis bloqué</li>
<li>Avoir un retour sur ce quoi je dois me focaliser pour la prochaine semaine, des nouvelles idées pour faire face aux problèmes que je n'ai pas su résoudre</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org399ccdb" class="outline-2">
<h2 id="org399ccdb"><span class="section-number-2">4</span> Algorithme distribué auto-stable</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgaa437fd" class="outline-3">
<h3 id="orgaa437fd"><span class="section-number-3">4.1</span> Définition algorithme distribué auto-stable</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Le concept s'auto stabilisation a été introduit par Dijkstra en 1973 dans le contexte des systèmes distribués, 
c'est à dire des systèmes fait d'un ensemble fini de process autonome interconnecté grâce à un réseau de 
communication, qui a pour but d'atteindre un objectif global. Dans ce cas le design d'un algorithme
distribué auto-stable peut sembler un peu complexe car chaque process doivent se coordiner entre eux 
bien que les process ont une vue partielle du système. Son état local et ses informations transmises 
via des supports de communication, généralement asynchrones, reliant le processus à une partie des autres processus.
</p>


<p>
 Tolérances aux fautes: 
L'algo converge d'un état illégitime à un état légitime dans un nombre fini d'étape
 Une fois que l'algo est dans un état légitime, il le reste
S'il y a une "transient fault" et que l'on retourne dans un état illégitime alors l'algorithme converge de lui-même 
jusqu'à atteindre un état légitime.
</p>

<p>
Plein de petits algos simples à la place d'un seul gros qui gère tout.
</p>

<p>
Un graphe où chaque noeuds contient des variables et une action de la forme guard -&gt; statement .
Si la guarde vaut true alors l'action est "enabled" 
Un noeud à accès uniquement aux variables de ses voisins 
</p>

<p>
A chaque étape "step", on regarde la liste des actions "enabled". 
Cependant on peut choisir différentes manières de procéder donc concept de de démon
</p>

<p>
Exemples non exhaustifs de démons :
</p>
<ol class="org-ol">
<li>Central : On active un seul noeud parmi la liste des noeuds et on mets à jour la liste des noeuds enabled</li>
<li>Synchrone : On active tous les noeuds de la liste</li>
<li>Distribué : On active au moins un noeuds parmi ceux enabled</li>
</ol>


<p>
3 propriétés
Closure : depuis un état légitime on reste dans un état légitime
Convergence : depuis un état illégitime on atteint un état légitime avec un nombre fini d'étape
Correctness 
</p>
</div>
</div>

<div id="outline-container-org2479e9f" class="outline-3">
<h3 id="org2479e9f"><span class="section-number-3">4.2</span> Example 1 : Coloring</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Algorithme</li>
<li>Exemple simple d'execution sous démon centrale</li>
<li>Exemple simple d'execution sous démon synchrone (pour montrer que ça marche pas )</li>
<li>Preuve</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0f148a" class="outline-3">
<h3 id="orgd0f148a"><span class="section-number-3">4.3</span> Example 2 : Token Ring Dijkstra</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Explication de l'algorithme pour pouvoir expliquer Why3do</li>
<li>Exemple d'éxecution simple sous démon central</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfc2db91" class="outline-2">
<h2 id="orgfc2db91"><span class="section-number-2">5</span> Explication des outils</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgde61268" class="outline-3">
<h3 id="orgde61268"><span class="section-number-3">5.1</span> Logique de Hoare</h3>
<div class="outline-text-3" id="text-5-1">
<p>
La logique de Hoare est un formalisme utilisé en informatique pour raisonner sur la correction des programmes impératifs. Elle utilise des triples de Hoare, notés {P} C {Q}, où :
</p>

<ul class="org-ul">
<li>P est la précondition, une assertion sur l'état du programme avant l'exécution de l'instruction ou du bloc d'instructions C.</li>
<li>C est l'instruction ou le bloc d'instructions du programme.</li>
<li>Q est la postcondition, une assertion sur l'état du programme après l'exécution de C.</li>
</ul>

<p>
Un triple de Hoare {P} C {Q} signifie que si la précondition P est vraie avant l'exécution de C, alors la postcondition Q sera vraie après l'exécution de C, à condition que C termine son exécution.
</p>

<p>
Règles  de la logique de Hoare : 
</p>
<ol class="org-ol">
<li><b><b>Règle de l'assignation</b></b> : Pour une instruction d'assignation x := e,
<ul class="org-ul">
<li>{P[e/x]} x := e {P}, où P[e/x] est l'assertion P avec toutes les occurrences de x remplacées par e.</li>
</ul></li>

<li><b><b>Règle de composition</b></b> : Pour deux instructions C1 et C2,
<ul class="org-ul">
<li>Si {P} C1 {Q} et {Q} C2 {R}, alors {P} C1; C2 {R}.</li>
</ul></li>

<li><b><b>Règle de la conditionnelle</b></b> : Pour une instruction if (b) then C1 else C2,
<ul class="org-ul">
<li>{P ∧ b} C1 {Q} et {P ∧ ¬b} C2 {Q} impliquent {P} if (b) then C1 else C2 {Q}.</li>
</ul></li>

<li><b><b>Règle de la boucle</b></b> : Pour une boucle while (b) do C,
<ul class="org-ul">
<li>{I ∧ b} C {I} implique {I} while (b) do C {I ∧ ¬b}, où I est un invariant de boucle.</li>
</ul></li>
</ol>


<p>
Considérons l'algorithme simple suivant qui incrémente une variable x :
</p>

<pre class="example">
{ x = 0 } 
x := x + 1 
{ x = 1 }
</pre>
<p>
La précondition est x = 0, l'instruction est x := x + 1, et la postcondition est x = 1. Le triple de Hoare correspondant est { x = 0 } x := x + 1 { x = 1 }.
</p>

<p>
En conclusion, la logique de Hoare permet de structurer le raisonnement sur les programmes en termes de préconditions et de postconditions, facilitant la vérification formelle de leur correction.
</p>
</div>
</div>
<div id="outline-container-org70a40eb" class="outline-3">
<h3 id="org70a40eb"><span class="section-number-3">5.2</span> SMT solver</h3>
<div class="outline-text-3" id="text-5-2">
<p>
-Reprendre le cours pour expliquer clairement
</p>
</div>
</div>
<div id="outline-container-org6ab24ed" class="outline-3">
<h3 id="org6ab24ed"><span class="section-number-3">5.3</span> Explication Why3</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Permet de spécifier formellement les propriétés attendues</li>
<li>Vérification de programme</li>
<li>Comment utiliser l'IDE</li>
<li>Langage Whyml (conçu pour la vérification formelle)</li>
<li>Proche d'ocaml (exctraction de code prouvé possible)</li>
<li>Logique de Hoare à l'aide de pré/post-conditions et variant/invariants de boucles.</li>
<li>Interaction avec prouveurs SMT installable et assistant de preuve</li>

<li>Informations et erreurs qui font perdre du temps</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaccf4f0" class="outline-2">
<h2 id="orgaccf4f0"><span class="section-number-2">6</span> Why3doTheWayOfHarmoniousDistributedSystemProofs</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7f3a04c" class="outline-3">
<h3 id="org7f3a04c"><span class="section-number-3">6.1</span> Explication du modèle : modelReadallEnable</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org1d5391b" class="outline-3">
<h3 id="org1d5391b"><span class="section-number-3">6.2</span> Explication de selfstab-ring</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Closure</li>
<li>Terminaison</li>
<li>Avantages et Limitations (Comparaison avec Sasa)
<ul class="org-ul">
<li>Lien direct avec Ocaml</li>
<li>Seulement le démon central</li>
<li>Etat initial fixé</li>
<li>Topologie fixée</li>
<li>Accès à tous les états et pas uniquement les voisins</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6267e67" class="outline-2">
<h2 id="org6267e67"><span class="section-number-2">7</span> Implémentation et preuve de l’algorithme de coloring basé sur le modèle de l'artefact</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org9d37931" class="outline-3">
<h3 id="org9d37931"><span class="section-number-3">7.1</span> Essai d'utilisation de org mode</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-python">print("hello world")
</pre>
</div>
<div class="org-src-container">
<pre class="src src-why3">(* On va prouver la closure et la terminaison de l'algo de coloration dans une topologie en anneau *)
module Coloring_Ring
  use list.List
  use int.Int
  use int.EuclideanDivision
  use map.Map
  use list.Mem
  use list.Length
  use ref.Ref
  use set.SetAppInt

  (* PARTIE 1: CLOSURE *)

  (* number of processes *)
  val constant n_nodes : int

  axiom at_least_two : 2 &lt; n_nodes

  (* Nombre de couleurs *)
  val constant k_color : int

  (* On suppose qu'il y a plus de couleurs que de noeuds (une couleur par noeud) *)
  axiom k_color_bound : n_nodes &lt;= k_color

  type node = int
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd492a51" class="outline-3">
<h3 id="orgd492a51"><span class="section-number-3">7.2</span> Explication détaillée</h3>
</div>

<div id="outline-container-orgda653b7" class="outline-3">
<h3 id="orgda653b7"><span class="section-number-3">7.3</span> Problèmes rencontrés et solutions</h3>
</div>
</div>

<div id="outline-container-org6822f50" class="outline-2">
<h2 id="org6822f50"><span class="section-number-2">8</span> Autres différents essais et faisabilité</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Pour tout état initial -&gt; Angle envisagé mais semble complexe</li>
<li>Pour toute topologie -&gt; angle pas du tout développé pendant mon stage</li>
<li>Noeuds peuvent accéder uniquement à leurs voisins -&gt; angle pas du tout développé pendant mon stage</li>
<li>Pouvoir activer plusieurs noeuds pendant un même step -&gt; développer avec une "implémentation" du model avec démon synchrone (non testé mais pas de smoke et vérifié par why3)</li>
</ul>
</div>
</div>



<div id="outline-container-org07e7ff1" class="outline-2">
<h2 id="org07e7ff1"><span class="section-number-2">9</span> Conclusion</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lilian Derain</p>
<p class="date">Created: 2024-07-03 Wed 11:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
